tests/setup/expected/customer-checkout/ÏRTIMID Hotel/expected-values.json

{"planSummary":{"completionDate":"21/10/2023","planDate":"21/08/2023","lastPaymentDate":"19/10/2023","paymentsFrom":"05/10/2023","totalCost":"400.00","installmentPeriod":"Fortnightly","InstallmentDay":"Thursday","totalNoOfInstallments":"5","numberOfInstalment":"2","installmentAmount":"12.50","priceWidget":"10.00","percentageInstallmentPaid":"94","paymentMethod":"0341","planStatus":"Late","planID":"ialjod7y1j89","remainingAmount":"25.00","totalFunds":"375.00","noOfInstallmentsPaid":"3","Remainder":"0.00","noOfInstallmentsToBePaid":"2","redemptionDate":"20/11/2023","checkoutCurrency":"AUD","currencySymbol":"$","message":"successful","paymentPlatform_vendor":"Stripe","paymentPlatform_variant":"Managed","checkoutType":"customer-checkout","skippedAmount":"","skippedInstalments":"","selectedInstallmentPeriod":"Weekly","selectedInstalmentType":"Monthly","Weekly":{"totalNoOfInstallments":"6","numberOfInstalment":"5","instalmentDate":7,"option":"deselected","status":"Available","instalmentAmount":"10.00"},"Fortnightly":{"totalNoOfInstallments":"5","numberOfInstalment":"4","instalmentDate":14,"option":"selected","status":"Available","instalmentAmount":"12.50"},"Monthly":{"totalNoOfInstallments":"3","numberOfInstalment":"2","instalmentDate":21,"option":"deselected","status":"Available","instalmentAmount":"25.00"},"effectiveDate":"05/10/2023"},"depositSettings":{"depositRuleApplied":"random","depositSetting":"random","requiredMinimumDeposit":"350.00","MaxDepositAmount":"390","depositPaid":"350.00","depositExcludingRemainder":"350.00","evenInstalmentAmount":"44.44","MaxDepositAmount_rounddown":"350.00","requiredMinimumDeposit_roundup":"350.00"},"fees":{"totalMerchantTransactionFee":"11.11","planPayFeesSoFar":"29.24","merchantRevenue":"333.26","TotalServiceFeesExcGST":"20","ServiceFeesExcGSTonPaid":"18.13","MerchantRevenueExcludingFees":""},"merchantDetails":{"merchantName":"ÏRTIMID Hotel","merchantId":"000abcd00ef0","sub_merchantName":"ÏRTIMID Hotel","sub_merchantId":"000aaaa00aa3","checkoutCategory":"submerchant"},"cancellationDetails":{"planCancellationDate":"","refundType":"","refundAmount":"","ActualRefundAmountUI":"","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"","totalNonRefundableDeposit":"","reason":""},"planDetails":{"productsQuantity":["2"],"productsAmount":["200.00"],"producItem":"Superior Deluxe King Guest room 1 King","items":[{"description":"Superior Deluxe King Guest room 1 King","redemptionDate":"20/November/2023"}],"poilcyType":""},"flags":{"cancelPlanFlag":"false","blockedCheckout":"false","eventProcessorError":"false","PaymentEligible":"false","blockedPayInstalment":"false","updateCadenceblocked":"false","selectionBlocked":"false","userExists":"false","latePayment":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Superior Deluxe King Guest room 1 King","Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)","Superior Studio Twin Larger Guest room 2 Double","Club King Club lounge access Guest room 1 King","Presidential Suite Club lounge access High floor"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation4192@mailinator.com","firstName":"planpaytesting_firstNameEiHB","lastName":"planpaytesting_lastNameSpZw","phoneNumber":"+61345678999","userVerified":"false","userStatus":"Active","accountCreated":"19/08/2023"},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[{"amount":"12.50","date":"19/10/2023","instalment":"5/5","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"}],"paidPayments":[{"amount":"350.00","date":"21/08/2023","actualPaidDate":"21/08/2023","instalment":"1/5","paymentMethodUsed":"4242","status":"Paid","paymentType":"DUETIME","remainder":"0.00","type":{"Charge":{"amountcapturedAvailable":"350.00","amountRefunded":"0.00"}},"paymentGatewayFee":10.45,"MerchantTransactionFee":10.45,"paymentGatewayFeeExcludedSalesTax":9.5,"serviceFee":17.5},{"amount":"12.50","date":"07/09/2023","instalment":"2/5","status":"Paid","paymentType":"DUETIME","remainder":"0.00","type":{"Charge":{"amountcapturedAvailable":"12.50","amountRefunded":"0.00"}},"paymentMethodUsed":"4242","actualPaidDate":"07/09/2023","paymentGatewayFee":0.66,"MerchantTransactionFee":0.66,"paymentGatewayFeeExcludedSalesTax":0.6,"serviceFee":0.63},{"amount":"12.50","date":"05/10/2023","instalment":"4/5","status":"Paid","paymentType":"DUETIME","remainder":"0.00","type":{"Charge":{"amountcapturedAvailable":"12.50","amountRefunded":"0.00"}},"paymentMethodUsed":"0341","actualPaidDate":"05/10/2023"}],"latePayments":[{"amount":"12.50","date":"21/09/2023","instalment":"3/5","status":"Overdue","paymentType":"LATE","remainder":"0.00"}],"skippedInstallment":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"ÏRTIMID Hotel","operationType":"","installmentType":"Fortnightly","screen":"CheckoutSummary"}}