tests/setup/expected/customer-checkout/Ñaamra Hotel/expected-values.json

{"planSummary":{"completionDate":"21/07/2024","planDate":"31/07/2023","lastPaymentDate":"09/10/2023","paymentsFrom":"31/07/2023","totalCost":"400.00","installmentPeriod":"Fortnightly","InstallmentDay":"Monday","totalNoOfInstallments":"26","numberOfInstalment":"25","installmentAmount":"10.00","priceWidget":"10.00","percentageInstallmentPaid":"88","paymentMethod":"4242","planStatus":"On Schedule","planID":"l0kf5p8qgjli","remainingAmount":"50.00","totalFunds":"350.00","noOfInstallmentsPaid":"1","Remainder":"0.00","noOfInstallmentsToBePaid":"5","redemptionDate":"20/08/2024","checkoutCurrency":"AUD","currencySymbol":"$","message":"successful","paymentPlatform_vendor":"Stripe","paymentPlatform_variant":"Managed","checkoutType":"customer-checkout","skippedAmount":"","skippedInstalments":"","selectedInstallmentPeriod":"Weekly","selectedInstalmentType":"Monthly","Weekly":{"totalNoOfInstallments":"6","numberOfInstalment":"5","instalmentDate":7,"option":"selected","status":"Available","instalmentAmount":"10.00"},"Fortnightly":{"totalNoOfInstallments":"6","numberOfInstalment":"5","instalmentDate":14,"option":"selected","status":"Available","instalmentAmount":"10.00"},"Monthly":{"totalNoOfInstallments":"6","numberOfInstalment":"5","instalmentDate":31,"option":"deselected","status":"Available","instalmentAmount":"10.00"}},"depositSettings":{"depositRuleApplied":"defaultMinDeposit","depositSetting":"default","requiredMinimumDeposit":"350.00","MaxDepositAmount":"390","depositPaid":"350.00","depositExcludingRemainder":"350.00","evenInstalmentAmount":"7.84","MaxDepositAmount_rounddown":"350.00","requiredMinimumDeposit_roundup":"350.00"},"fees":{"totalMerchantTransactionFee":"10.45","planPayFeesSoFar":"27.95","merchantRevenue":"322.05","TotalServiceFeesExcGST":"20","ServiceFeesExcGSTonPaid":"17.5","MerchantRevenueExcludingFees":""},"merchantDetails":{"merchantName":"Ñaamra Hotel","merchantId":"000abcd00ef0","sub_merchantName":"Ñaamra Hotel","sub_merchantId":"000aaaa00aa1","checkoutCategory":"submerchant"},"cancellationDetails":{"planCancellationDate":"","refundType":"","refundAmount":"","ActualRefundAmountUI":"","FinalNonRefundAmount":"","CustomerRefundValue":"","nonRefundableDeposit":"","totalNonRefundableDeposit":"","reason":""},"planDetails":{"productsQuantity":["2"],"productsAmount":["200.00"],"producItem":"Superior Deluxe King Guest room 1 King","items":[{"description":"Superior Deluxe King Guest room 1 King","redemptionDate":"20/August/2024"}]},"flags":{"cancelPlanFlag":"false","blockedCheckout":"true","eventProcessorError":"false","PaymentEligible":"false","blockedPayInstalment":"false","updateCadenceblocked":"false","selectionBlocked":"false","userExists":"false"},"MerchantEnv":{"selectedMerchant":{},"productList":["Superior Deluxe King Guest room 1 King","Superior Deluxe Twin Guest room 2 Twin/Single Bed(s)","Superior Studio Twin Larger Guest room 2 Double","Club King Club lounge access Guest room 1 King","Presidential Suite Club lounge access High floor"],"itemPrelocator":"","itemPostlocator":""},"customer":{"Email":"planpaytestingautomation8824@mailinator.com","firstName":"planpaytesting_firstNameieZm","lastName":"planpaytesting_lastNameKumW","phoneNumber":"+61345678999","userVerified":"false","userStatus":"Active","accountCreated":"31/07/2023"},"customerLog":{"Email":"","firstName":"","lastName":"","phoneNumber":""},"UpcomingPayments":[{"amount":"10.00","date":"14/08/2023","instalment":"2/6","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"10.00","date":"28/08/2023","instalment":"3/6","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"10.00","date":"11/09/2023","instalment":"4/6","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"10.00","date":"25/09/2023","instalment":"5/6","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"},{"amount":"10.00","date":"09/10/2023","instalment":"6/6","status":"On Schedule","paymentType":"DUETIME","remainder":"0.00"}],"paidPayments":[{"amount":"350.00","date":"31/07/2023","actualPaidDate":"31/07/2023","instalment":"1/6","paymentMethodUsed":"4242","status":"Paid","paymentType":"DUETIME","remainder":"0.00","paymentGatewayFee":10.45,"MerchantTransactionFee":10.45,"paymentGatewayFeeExcludedSalesTax":9.5,"serviceFee":17.5}],"latePayments":[],"skippedInstallment":[],"LocalEnv":{"applicationName":"merchant-testing","merchantName":"Ñaamra Hotel","operationType":"","installmentType":"Fortnightly","screen":"CheckoutSummary"}}